<?php

// 4. Дана функция поиска пользователей по email. Опишите, пожалуйста, какие вы
// видите потенциальные проблемы данной функции.

function searchUsersByEmail($email = '') {
//    Параметр $email не имеет описания типа, надо указать ?string и функция
//    должна иметь тип возвращаемого значения. В данном случае array.
//    Т.к. пользователей может быть очень много, то можно было бы добавить параметры
//    для пагинации int $offset = 0, int $limit

    global $limit;
//    global недопустимо использовать. Изменение глобальной переменной в одной части программы, может
//    привести к краху в другой части кода.
    $out = array();
//    слово array заменил бы на [], но это не обязательно

    $query = 'SELECT * FROM users WHERE email LIKE ' . $email;
//    Добавление переменной $email, таким образом не безопасно.
//    Может быть SQL-инъекция. Нужно пользоваться pdo->bindParam
//    Выборка всех полей тоже не хорошо. Полей может быть очень много.
//    Нужно всегда перечислять те поля которые нужны.
    if ($res = @mysql_query($query)) {
//    Подавление ошибок через символ @ - это очень плохая практика.
//    Ошибки нужно выводить на дев окружение и логировать на прод окружении.
//    mysql_query устарел уже, надо забыть о нем и пользоваться PDO::query()
        while ($arr = @mysql_fetch_array($res)) {
//    Подавление ошибок через символ @ - это очень плохая практика.
//    mysql_fetch_array устарел уже, надо забыть о нем и пользоваться PDOStatement::fetch()
            $out[] = $arr;
            if (count($out) > $limit) {
                break;
            }
        }
    }
    return $out;
}

